{===============================================================================

Author  : Ivan Dyachenko
E-mail  : ivan.dyachenko@gmail.com
Site    : http://atgrand.com
Project : http://clevertis.atgrand.com
Date    : 22.09.2007 16:06:43

===============================================================================}

unit iCore2;

interface

uses Messages, Classes, SysUtils, iHashString, Unicode;

const  DSize = 2048;

{==============================================================================}

type

{===============================================================================

  Видеть ?...

  А зачем тебе Видеть ???
  Неужто ты не веришь в то, что предстваленный тобою мир настоящий ...?
  А может ты не хочешь, чтобы он был безупречен ..?.

  iCore только загружает dll-ки !

  -Хочу в-и-д-е-т-ь.
  -А зачем тебе видеть? Неужто ты не веришь в то, что представленный тобой
  мир-настоящий? А может ты не хочешь, чтобы он был безупречен.


  Ваня, все будет дас из гуд:) "заставка Прусского радио"
  Люблю тебя. Нечего в Космос смотреть. :)
  Гадюка он, этот космос:)

  А я хочу видеть, только то, что мне Хочется видеть. Только не получается.
  Видится почти все. А надо "фильтровать" зрение:) Как и базар:)

===============================================================================}

var _type        : TStringHashInt;
    _uses        : THashedVarList;

//------------------------------------------------------------------------------

implementation

//------------------------------------------------------------------------------

initialization

   _type := TStringHashInt.Create(nil);
   _uses := THashedVarList.Create(nil);

finalization

  _uses.Free;
  _type.Free;

end.


